Cases/5.0mps/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2312
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; object omega; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1.0;

boundaryField
{
    inlet  { type fixedValue; value $internalField; }
    outlet { type zeroGradient; }
    "(wall|slag)" { type omegaWallFunction; value $internalField; }
}